// pages/news/news.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    act_pic:[
      {"url":"/pages/news/news","srcs":"/images/project/recomm2.jpg","title":"河南省非遗保护与旅游活化路径","text":"非物质文化遗产是中华优秀传统文化的重要组成部分，是中华文明绵延传承的生动见证。作为非遗大省，河南省非遗资源类型完备、内涵丰富、特色鲜明，是中原文化根源性、原创性、包容性、开放性、基础性的重要表征。在河南省“文旅文创融合战略”“乡村振兴战略”有序推进的背景下，深入调研我省非遗保护传承现状及存在问题，探索非遗保护传承与旅游活化的发展路径，实现“以文塑旅，以旅彰文”","time":"2024/12/10","category":"新闻直达"}
    ]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})