// pages/more/more.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    act_pic:[
      {"url":"/pages/more/more","srcs":"/images/project/recomm1.jpg","title":"“璞玉嵌丝：传统工艺的创新之路”","text":" 中国非物质文化遗产传承人群研修研习培训计划（以下称“研培计划”）是《国家“十三五”文化发展改革规划纲要》提出的重要任务，是非物质文化遗产（以下称“非遗”）保护事业的一项基础性、战略性工作。该计划旨在为非遗保护工作提供高校的学术和教学资源支持，通过组织非遗项目持有者、从业者等传承人群到高校学习专业知识、研究技艺和技术、开展交流研讨与实践，帮助非遗传承人群强基础、拓眼界、增学养，增强文化自信，提高专业技术能力和可持续发展能力，提升非遗保护传承水平。同时也丰富参与院校的学术和科研积累，完善相关学科体系建设，更好地发挥文化传承创新功能。","time":"2024/12/29","category":"科技创新"},
    ]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})